/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: napark <napark@studenst.42seoul.kr>        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/03/13 22:30:38 by napark            #+#    #+#             */
/*   Updated: 2021/03/13 22:37:21 by napark           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int     ft_isalnum(int c)
{
    if (ft_isalpha(c) || ft_isdigit(c))//숫자 혹은 알파벳이 있으면 true를 반환
        return (1);
    else
        return (0);
}